import numpy as np
import matplotlib.pyplot as plt

data = {
    "白马啸西风": [8.773, 8.297, 12.911, 12.668, 14.42, 14.585],
    "碧血剑": [10.363, 9.029, 15.606, 14.571, 17.388, 17.154],
    "飞狐外传": [10.201, 8.905, 15.364, 14.315, 17.201, 16.917],
    "连城诀": [9.706, 8.726, 14.508, 13.783, 16.186, 16.127],
    "鹿鼎记": [9.948, 8.813, 15.449, 14.297, 17.839, 17.318],
    "三十三剑客图": [10.289, 8.961, 14.303, 14.105, 15.113, 15.491],
    "射雕英雄传": [10.278, 8.961, 15.763, 14.578, 17.936, 17.513],
    "神雕侠侣": [10.275, 8.943, 15.869, 14.61, 18.069, 17.607],
    "书剑恩仇录": [10.275, 9.007, 15.503, 14.436, 17.375, 17.052],
    "天龙八部": [10.237, 8.943, 15.783, 14.57, 18.068, 17.607],
    "侠客行": [9.839, 8.737, 14.773, 13.921, 16.608, 16.428],
    "笑傲江湖": [10.047, 8.81, 15.507, 14.263, 17.798, 17.219],
    "雪山飞狐": [9.811, 8.784, 14.265, 13.699, 15.617, 15.703],
    "倚天屠龙记": [10.333, 8.97, 15.831, 14.568, 17.987, 17.506],
    "鸳鸯刀": [8.904, 8.426, 12.5, 12.524, 13.634, 13.986],
    "越女剑": [8.596, 8.232, 11.756, 11.878, 12.679, 13.095]
}

labels = ["一元模型词信息熵", "一元模型字信息熵", "二元模型词信息熵", "三元模型字信息熵", "三元模型词信息熵", "一元模型字信息熵"]
colors = ['b', 'g', 'r', 'c', 'm', 'y']

plt.figure(figsize=(10, 6))

for i in range(6):
    x = np.arange(1, len(data) + 1)
    y = [row[i] for row in data.values()]
    plt.plot(x, y, label=labels[i], color=colors[i])
plt.rcParams['font.sans-serif'] = ['SimSun']  # 指定要使用的中文字体为宋体
plt.xlabel('书名')
plt.ylabel('平均信息熵')
plt.title('中文字/词平均信息熵')
plt.xticks(np.arange(1, len(data) + 1), list(data.keys()), rotation=90)
plt.legend()
plt.tight_layout()
plt.legend(loc='lower center', bbox_to_anchor=(0.5, -0.3), ncol=3)
plt.show()
